tutorials/capillaryRise2D/init/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    freeSurface
    {
        type            freeSurfaceVelocity;
        value           uniform (0 0 0);
    }

    bottom
    {
      //type            slip;
      type              fixedValue;
      value             uniform (0 0 0);
    }

    left
    {
      //type            slip;
       type            navierSlip;
       value           uniform (0 0 0);
       slipLength      uniform 1e-03;
       wallVelocity    uniform (0 0 0);
       
    }

    right
    {
      //type            slip;
      type            navierSlip;
      value           uniform (0 0 0);
      slipLength      uniform 1e-03;
      wallVelocity    uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
